Tekla.Structures.Dialog.Localization
The Localization class is for translating strings in .NET dialogs.

Tekla.Structures.Dialog.Localization.#ctor
Creates a new localization instance.

Tekla.Structures.Dialog.Localization.#ctor(System.String,System.String)
Creates a new localization instance.
fileName: The file from which the localization strings are loaded.
language: The set localization language.

Tekla.Structures.Dialog.Localization.DefaultLocalizationFile
The path and name of the default localization file.

Tekla.Structures.Dialog.Localization.DefaultLocalizationPath
The path and directory name where to find localization files.

Tekla.Structures.Dialog.Localization.GetLocalizationFileFullPath(System.String)
Returns localization file if found from environment
fileName: filename to search
Returns:

Tekla.Structures.Dialog.Localization.LoadFile(System.String)
Loads the localization strings from a file. Several files may be used concurrently,
just call LoadFile for each file. The translations are searched in the loading order and the first match is returned.
The method uses the extension of the filename to identify the file type
(".xml", ".aid" or ".ail").
fileName: The file to be loaded.

Tekla.Structures.Dialog.Localization.LoadAidFile(System.String)
Loads the localization strings from an aid file. Several files may be used concurrently,
just call LoadAidFile for each file. The translations are searched in the loading order and the first match is returned.
fileName: The aid file to be loaded.

Tekla.Structures.Dialog.Localization.LoadAilFile(System.String)
Loads the localization strings from an ail file. Several files may be used concurrently,
just call LoadAilFile for each file. The translations are searched in the loading order and the first match is returned.
fileName: The ail file to be loaded.

Tekla.Structures.Dialog.Localization.LoadXMLFile(System.String)
Loads the localization strings from an xml file. Several files may be used concurrently,
just call LoadXMLFile for each file. The translations are searched in the loading order and the first match is returned.
fileName: The xml file to be loaded.

Tekla.Structures.Dialog.Localization.Language
Gets or sets the language that is currently used in Tekla Structures.

Tekla.Structures.Dialog.Localization.RegisterLocalizationCallback(Tekla.Structures.Dialog.Localization.LocalizationCallback,System.Type[])
Registers a localization callback which is used to translate the registered control types.
cb: The localization delegate.
types: An array of types which will trigger the current delegate.

Tekla.Structures.Dialog.Localization.LocalizeToolTip(System.Windows.Forms.Control,System.Windows.Forms.ToolTip)
Localizes a ToolTip control.
control: The root control for all the controls which should be localized.
toolTip: The ToolTip instance.

Tekla.Structures.Dialog.Localization.Localize(System.Windows.Forms.MenuItem)
Localizes a MenuItem control recursively.
menuItem: The MenuItem instance.

Tekla.Structures.Dialog.Localization.Localize(System.Windows.Forms.Control)
Localizes a control recursively.
control: The control instance.

Tekla.Structures.Dialog.Localization.Localize(System.Configuration.ApplicationSettingsBase)
Localizes application settings.
applicationSettings: The application settings that should be localized.

Tekla.Structures.Dialog.Localization.ControlDesignMode(System.Windows.Forms.Control)
returns if its in design mode
control:
Returns:

Tekla.Structures.Dialog.Localization.Initialize
initialize localization

Tekla.Structures.Dialog.Localization.GetText(System.String)
Gets the translation for the current language.
The translations are searched with the given identifier string.
name: The identifier string.
Returns: The translated string.

Tekla.Structures.Dialog.Localization.GetString(System.String)
gets string
name:
Returns:

Tekla.Structures.Dialog.Localization.GetString(System.String,System.String)
Gets the translation for the given language.
The translations are searched with the given identifier string.
name: The identifier string.
language: The target language.
Returns: The translated string.

Tekla.Structures.Dialog.Localization.CreateIdentifier(System.Object,System.String)
creates identifier
obj:
label:
Returns:

Tekla.Structures.Dialog.Localization.GetCleanName(System.String)
gets clean name
name:
Returns: